espressif/esp-mesh-lite/mesh_root/sdkconfig.defaults
# Target / toolchain
CONFIG_IDF_TARGET="esp32s3"

# ========= FreeRTOS (safe defaults) =========
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=3072
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# ========= ESP32-S3 specifics =========
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096

# ========= PSRAM (your module has 8MB PSRAM) =========
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# ========= TCP/IP / NAT helpers (Mesh-Lite examples use these) =========
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y

# ========= Mesh-Lite core =========
CONFIG_MESH_LITE_ENABLE=y
CONFIG_MESH_LITE_NODE_INFO_REPORT=y
# If you want less chatty logs, you can later tune MESH_LITE log level in menuconfig.

# ========= Mesh backhaul + local SoftAP (used by our helper) =========
CONFIG_MESH_CHANNEL=6
CONFIG_BRIDGE_SOFTAP_SSID="meshmesh"
CONFIG_BRIDGE_SOFTAP_PASSWORD="12345678"
CONFIG_BRIDGE_SOFTAP_SSID_END_WITH_THE_MAC=n

# ========= LVGL port (small/safe footprint) =========
CONFIG_LVGL_PORT=y
CONFIG_LVGL_USE_DEMOS=n
CONFIG_LVGL_TICK_CUSTOM=y
CONFIG_LVGL_TICK_CUSTOM_PERIOD_US=5000
CONFIG_LVGL_MEM_CUSTOM=y

# ========= IDF RGB LCD peripheral (for when we bind the panel) =========
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
# Double-buffering is typical; leave defaults for now so it builds everywhere.

# (Optional, quieter build)
# CONFIG_LOG_DEFAULT_LEVEL_INFO=y
